apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_usart.h
/*****************************************************************************************************
 * arch/arm/src/lpc54xx/chip/lpc54_usart.h
 *
 *   Copyright (C) 2017 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 *****************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_USART_H
#define __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_USART_H

/*****************************************************************************************************
 * Included Files
 *****************************************************************************************************/

#include <nuttx/config.h>
#include "chip/lpc54_memorymap.h"

/*****************************************************************************************************
 * Pre-processor Definitions
 *****************************************************************************************************/

#define LPC54_USART_FIFO_DEPTH          8       /* All FIFOs are 16x8-bits */

/* USART Register Offsets ***************************************************************************/

/* Registers for the USART function: */

#define LPC54_USART_CFG_OFFSET          0x0000  /* USART Configuration register */
#define LPC54_USART_CTL_OFFSET          0x0004  /* USART Control register */
#define LPC54_USART_STAT_OFFSET         0x0008  /* USART Status register */
#define LPC54_USART_INTENSET_OFFSET     0x000c  /* USART Interrupt Enable read and Set register */
#define LPC54_USART_INTENCLR_OFFSET     0x0010  /* USART Interrupt Enable Clear register */
#define LPC54_USART_BRG_OFFSET          0x0020  /* USART Baud Rate Generator register */
#define LPC54_USART_INTSTAT_OFFSET      0x0024  /* USART Interrupt status register */
#define LPC54_USART_OSR_OFFSET          0x0028  /* USART Oversample selection register */

/* Registers for FIFO control and data access: */

#define LPC54_USART_FIFOCFG_OFFSET      0x0e00  /* FIFO configuration and enable register */
#define LPC54_USART_FIFOSTAT_OFFSET     0x0e04  /* FIFO status register */
#define LPC54_USART_FIFOTRIG_OFFSET     0x0e08  /* FIFO trigger settings for interrupt and DMA request */
#define LPC54_USART_FIFOINTENSET_OFFSET 0x0e10  /* FIFO interrupt enable set (enable) and read register */
#define LPC54_USART_FIFOINTENCLR_OFFSET 0x0e14  /* FIFO interrupt enable clear (disable) and read register */
#define LPC54_USART_FIFOINTSTAT_OFFSET  0x0e18  /* FIFO interrupt status register */
#define LPC54_USART_FIFOWR_OFFSET       0x0e20  /* FIFO write data */
#define LPC54_USART_FIFORD_OFFSET       0x0e30  /* FIFO read data */
#define LPC54_USART_FIFORDNOPOP_OFFSET  0x0e40  /* FIFO data read with no FIFO pop */

/* ID register: */

#define LPC54_USART_ID_OFFSET           0x0ffc  /* USART module Identification */

/* USART Register Adreesses **************************************************************************/

#define LPC54_USART0_CFG                (LPC54_FLEXCOMM0_BASE+LPC54_USART_CFG_OFFSET)
#define LPC54_USART0_CTL                (LPC54_FLEXCOMM0_BASE+LPC54_USART_CTL_OFFSET)
#define LPC54_USART0_STAT               (LPC54_FLEXCOMM0_BASE+LPC54_USART_STAT_OFFSET)
#define LPC54_USART0_INTENSET           (LPC54_FLEXCOMM0_BASE+LPC54_USART_INTENSET_OFFSET)
#define LPC54_USART0_INTENCLR           (LPC54_FLEXCOMM0_BASE+LPC54_USART_INTENCLR_OFFSET)
#define LPC54_USART0_BRG                (LPC54_FLEXCOMM0_BASE+LPC54_USART_BRG_OFFSET)
#define LPC54_USART0_INTSTAT            (LPC54_FLEXCOMM0_BASE+LPC54_USART_INTSTAT_OFFSET)
#define LPC54_USART0_OSR                (LPC54_FLEXCOMM0_BASE+LPC54_USART_OSR_OFFSET)
#define LPC54_USART0_FIFOCFG            (LPC54_FLEXCOMM0_BASE+LPC54_USART_FIFOCFG_OFFSET)
#define LPC54_USART0_FIFOSTAT           (LPC54_FLEXCOMM0_BASE+LPC54_USART_FIFOSTAT_OFFSET)
#define LPC54_USART0_FIFOTRIG           (LPC54_FLEXCOMM0_BASE+LPC54_USART_FIFOTRIG_OFFSET)
#define LPC54_USART0_FIFOINTENSET       (LPC54_FLEXCOMM0_BASE+LPC54_USART_FIFOINTENSET_OFFSET)
#define LPC54_USART0_FIFOINTENCLR       (LPC54_FLEXCOMM0_BASE+LPC54_USART_FIFOINTENCLR_OFFSET)
#define LPC54_USART0_FIFOINTSTAT        (LPC54_FLEXCOMM0_BASE+LPC54_USART_FIFOINTSTAT_OFFSET)
#define LPC54_USART0_FIFOWR             (LPC54_FLEXCOMM0_BASE+LPC54_USART_FIFOWR_OFFSET)
#define LPC54_USART0_FIFORD             (LPC54_FLEXCOMM0_BASE+LPC54_USART_FIFORD_OFFSET)
#define LPC54_USART0_FIFORDNOPOP        (LPC54_FLEXCOMM0_BASE+LPC54_USART_FIFORDNOPOP_OFFSET)
#define LPC54_USART0_ID                 (LPC54_FLEXCOMM0_BASE+LPC54_USART_ID_OFFSET)

#define LPC54_USART1_CFG                (LPC54_FLEXCOMM1_BASE+LPC54_USART_CFG_OFFSET)
#define LPC54_USART1_CTL                (LPC54_FLEXCOMM1_BASE+LPC54_USART_CTL_OFFSET)
#define LPC54_USART1_STAT               (LPC54_FLEXCOMM1_BASE+LPC54_USART_STAT_OFFSET)
#define LPC54_USART1_INTENSET           (LPC54_FLEXCOMM1_BASE+LPC54_USART_INTENSET_OFFSET)
#define LPC54_USART1_INTENCLR           (LPC54_FLEXCOMM1_BASE+LPC54_USART_INTENCLR_OFFSET)
#define LPC54_USART1_BRG                (LPC54_FLEXCOMM1_BASE+LPC54_USART_BRG_OFFSET)
#define LPC54_USART1_INTSTAT            (LPC54_FLEXCOMM1_BASE+LPC54_USART_INTSTAT_OFFSET)
#define LPC54_USART1_OSR                (LPC54_FLEXCOMM1_BASE+LPC54_USART_OSR_OFFSET)
#define LPC54_USART1_FIFOCFG            (LPC54_FLEXCOMM1_BASE+LPC54_USART_FIFOCFG_OFFSET)
#define LPC54_USART1_FIFOSTAT           (LPC54_FLEXCOMM1_BASE+LPC54_USART_FIFOSTAT_OFFSET)
#define LPC54_USART1_FIFOTRIG           (LPC54_FLEXCOMM1_BASE+LPC54_USART_FIFOTRIG_OFFSET)
#define LPC54_USART1_FIFOINTENSET       (LPC54_FLEXCOMM1_BASE+LPC54_USART_FIFOINTENSET_OFFSET)
#define LPC54_USART1_FIFOINTENCLR       (LPC54_FLEXCOMM1_BASE+LPC54_USART_FIFOINTENCLR_OFFSET)
#define LPC54_USART1_FIFOINTSTAT        (LPC54_FLEXCOMM1_BASE+LPC54_USART_FIFOINTSTAT_OFFSET)
#define LPC54_USART1_FIFOWR             (LPC54_FLEXCOMM1_BASE+LPC54_USART_FIFOWR_OFFSET)
#define LPC54_USART1_FIFORD             (LPC54_FLEXCOMM1_BASE+LPC54_USART_FIFORD_OFFSET)
#define LPC54_USART1_FIFORDNOPOP        (LPC54_FLEXCOMM1_BASE+LPC54_USART_FIFORDNOPOP_OFFSET)
#define LPC54_USART1_ID                 (LPC54_FLEXCOMM1_BASE+LPC54_USART_ID_OFFSET)

#define LPC54_USART2_CFG                (LPC54_FLEXCOMM2_BASE+LPC54_USART_CFG_OFFSET)
#define LPC54_USART2_CTL                (LPC54_FLEXCOMM2_BASE+LPC54_USART_CTL_OFFSET)
#define LPC54_USART2_STAT               (LPC54_FLEXCOMM2_BASE+LPC54_USART_STAT_OFFSET)
#define LPC54_USART2_INTENSET           (LPC54_FLEXCOMM2_BASE+LPC54_USART_INTENSET_OFFSET)
#define LPC54_USART2_INTENCLR           (LPC54_FLEXCOMM2_BASE+LPC54_USART_INTENCLR_OFFSET)
#define LPC54_USART2_BRG                (LPC54_FLEXCOMM2_BASE+LPC54_USART_BRG_OFFSET)
#define LPC54_USART2_INTSTAT            (LPC54_FLEXCOMM2_BASE+LPC54_USART_INTSTAT_OFFSET)
#define LPC54_USART2_OSR                (LPC54_FLEXCOMM2_BASE+LPC54_USART_OSR_OFFSET)
#define LPC54_USART2_FIFOCFG            (LPC54_FLEXCOMM2_BASE+LPC54_USART_FIFOCFG_OFFSET)
#define LPC54_USART2_FIFOSTAT           (LPC54_FLEXCOMM2_BASE+LPC54_USART_FIFOSTAT_OFFSET)
#define LPC54_USART2_FIFOTRIG           (LPC54_FLEXCOMM2_BASE+LPC54_USART_FIFOTRIG_OFFSET)
#define LPC54_USART2_FIFOINTENSET       (LPC54_FLEXCOMM2_BASE+LPC54_USART_FIFOINTENSET_OFFSET)
#define LPC54_USART2_FIFOINTENCLR       (LPC54_FLEXCOMM2_BASE+LPC54_USART_FIFOINTENCLR_OFFSET)
#define LPC54_USART2_FIFOINTSTAT        (LPC54_FLEXCOMM2_BASE+LPC54_USART_FIFOINTSTAT_OFFSET)
#define LPC54_USART2_FIFOWR             (LPC54_FLEXCOMM2_BASE+LPC54_USART_FIFOWR_OFFSET)
#define LPC54_USART2_FIFORD             (LPC54_FLEXCOMM2_BASE+LPC54_USART_FIFORD_OFFSET)
#define LPC54_USART2_FIFORDNOPOP        (LPC54_FLEXCOMM2_BASE+LPC54_USART_FIFORDNOPOP_OFFSET)
#define LPC54_USART2_ID                 (LPC54_FLEXCOMM2_BASE+LPC54_USART_ID_OFFSET)

#define LPC54_USART3_CFG                (LPC54_FLEXCOMM3_BASE+LPC54_USART_CFG_OFFSET)
#define LPC54_USART3_CTL                (LPC54_FLEXCOMM3_BASE+LPC54_USART_CTL_OFFSET)
#define LPC54_USART3_STAT               (LPC54_FLEXCOMM3_BASE+LPC54_USART_STAT_OFFSET)
#define LPC54_USART3_INTENSET           (LPC54_FLEXCOMM3_BASE+LPC54_USART_INTENSET_OFFSET)
#define LPC54_USART3_INTENCLR           (LPC54_FLEXCOMM3_BASE+LPC54_USART_INTENCLR_OFFSET)
#define LPC54_USART3_BRG                (LPC54_FLEXCOMM3_BASE+LPC54_USART_BRG_OFFSET)
#define LPC54_USART3_INTSTAT            (LPC54_FLEXCOMM3_BASE+LPC54_USART_INTSTAT_OFFSET)
#define LPC54_USART3_OSR                (LPC54_FLEXCOMM3_BASE+LPC54_USART_OSR_OFFSET)
#define LPC54_USART3_FIFOCFG            (LPC54_FLEXCOMM3_BASE+LPC54_USART_FIFOCFG_OFFSET)
#define LPC54_USART3_FIFOSTAT           (LPC54_FLEXCOMM3_BASE+LPC54_USART_FIFOSTAT_OFFSET)
#define LPC54_USART3_FIFOTRIG           (LPC54_FLEXCOMM3_BASE+LPC54_USART_FIFOTRIG_OFFSET)
#define LPC54_USART3_FIFOINTENSET       (LPC54_FLEXCOMM3_BASE+LPC54_USART_FIFOINTENSET_OFFSET)
#define LPC54_USART3_FIFOINTENCLR       (LPC54_FLEXCOMM3_BASE+LPC54_USART_FIFOINTENCLR_OFFSET)
#define LPC54_USART3_FIFOINTSTAT        (LPC54_FLEXCOMM3_BASE+LPC54_USART_FIFOINTSTAT_OFFSET)
#define LPC54_USART3_FIFOWR             (LPC54_FLEXCOMM3_BASE+LPC54_USART_FIFOWR_OFFSET)
#define LPC54_USART3_FIFORD             (LPC54_FLEXCOMM3_BASE+LPC54_USART_FIFORD_OFFSET)
#define LPC54_USART3_FIFORDNOPOP        (LPC54_FLEXCOMM3_BASE+LPC54_USART_FIFORDNOPOP_OFFSET)
#define LPC54_USART3_ID                 (LPC54_FLEXCOMM3_BASE+LPC54_USART_ID_OFFSET)

#define LPC54_USART4_CFG                (LPC54_FLEXCOMM4_BASE+LPC54_USART_CFG_OFFSET)
#define LPC54_USART4_CTL                (LPC54_FLEXCOMM4_BASE+LPC54_USART_CTL_OFFSET)
#define LPC54_USART4_STAT               (LPC54_FLEXCOMM4_BASE+LPC54_USART_STAT_OFFSET)
#define LPC54_USART4_INTENSET           (LPC54_FLEXCOMM4_BASE+LPC54_USART_INTENSET_OFFSET)
#define LPC54_USART4_INTENCLR           (LPC54_FLEXCOMM4_BASE+LPC54_USART_INTENCLR_OFFSET)
#define LPC54_USART4_BRG                (LPC54_FLEXCOMM4_BASE+LPC54_USART_BRG_OFFSET)
#define LPC54_USART4_INTSTAT            (LPC54_FLEXCOMM4_BASE+LPC54_USART_INTSTAT_OFFSET)
#define LPC54_USART4_OSR                (LPC54_FLEXCOMM4_BASE+LPC54_USART_OSR_OFFSET)
#define LPC54_USART4_FIFOCFG            (LPC54_FLEXCOMM4_BASE+LPC54_USART_FIFOCFG_OFFSET)
#define LPC54_USART4_FIFOSTAT           (LPC54_FLEXCOMM4_BASE+LPC54_USART_FIFOSTAT_OFFSET)
#define LPC54_USART4_FIFOTRIG           (LPC54_FLEXCOMM4_BASE+LPC54_USART_FIFOTRIG_OFFSET)
#define LPC54_USART4_FIFOINTENSET       (LPC54_FLEXCOMM4_BASE+LPC54_USART_FIFOINTENSET_OFFSET)
#define LPC54_USART4_FIFOINTENCLR       (LPC54_FLEXCOMM4_BASE+LPC54_USART_FIFOINTENCLR_OFFSET)
#define LPC54_USART4_FIFOINTSTAT        (LPC54_FLEXCOMM4_BASE+LPC54_USART_FIFOINTSTAT_OFFSET)
#define LPC54_USART4_FIFOWR             (LPC54_FLEXCOMM4_BASE+LPC54_USART_FIFOWR_OFFSET)
#define LPC54_USART4_FIFORD             (LPC54_FLEXCOMM4_BASE+LPC54_USART_FIFORD_OFFSET)
#define LPC54_USART4_FIFORDNOPOP        (LPC54_FLEXCOMM4_BASE+LPC54_USART_FIFORDNOPOP_OFFSET)
#define LPC54_USART4_ID                 (LPC54_FLEXCOMM4_BASE+LPC54_USART_ID_OFFSET)

#define LPC54_USART5_CFG                (LPC54_FLEXCOMM5_BASE+LPC54_USART_CFG_OFFSET)
#define LPC54_USART5_CTL                (LPC54_FLEXCOMM5_BASE+LPC54_USART_CTL_OFFSET)
#define LPC54_USART5_STAT               (LPC54_FLEXCOMM5_BASE+LPC54_USART_STAT_OFFSET)
#define LPC54_USART5_INTENSET           (LPC54_FLEXCOMM5_BASE+LPC54_USART_INTENSET_OFFSET)
#define LPC54_USART5_INTENCLR           (LPC54_FLEXCOMM5_BASE+LPC54_USART_INTENCLR_OFFSET)
#define LPC54_USART5_BRG                (LPC54_FLEXCOMM5_BASE+LPC54_USART_BRG_OFFSET)
#define LPC54_USART5_INTSTAT            (LPC54_FLEXCOMM5_BASE+LPC54_USART_INTSTAT_OFFSET)
#define LPC54_USART5_OSR                (LPC54_FLEXCOMM5_BASE+LPC54_USART_OSR_OFFSET)
#define LPC54_USART5_FIFOCFG            (LPC54_FLEXCOMM5_BASE+LPC54_USART_FIFOCFG_OFFSET)
#define LPC54_USART5_FIFOSTAT           (LPC54_FLEXCOMM5_BASE+LPC54_USART_FIFOSTAT_OFFSET)
#define LPC54_USART5_FIFOTRIG           (LPC54_FLEXCOMM5_BASE+LPC54_USART_FIFOTRIG_OFFSET)
#define LPC54_USART5_FIFOINTENSET       (LPC54_FLEXCOMM5_BASE+LPC54_USART_FIFOINTENSET_OFFSET)
#define LPC54_USART5_FIFOINTENCLR       (LPC54_FLEXCOMM5_BASE+LPC54_USART_FIFOINTENCLR_OFFSET)
#define LPC54_USART5_FIFOINTSTAT        (LPC54_FLEXCOMM5_BASE+LPC54_USART_FIFOINTSTAT_OFFSET)
#define LPC54_USART5_FIFOWR             (LPC54_FLEXCOMM5_BASE+LPC54_USART_FIFOWR_OFFSET)
#define LPC54_USART5_FIFORD             (LPC54_FLEXCOMM5_BASE+LPC54_USART_FIFORD_OFFSET)
#define LPC54_USART5_FIFORDNOPOP        (LPC54_FLEXCOMM5_BASE+LPC54_USART_FIFORDNOPOP_OFFSET)
#define LPC54_USART5_ID                 (LPC54_FLEXCOMM5_BASE+LPC54_USART_ID_OFFSET)

#define LPC54_USART6_CFG                (LPC54_FLEXCOMM6_BASE+LPC54_USART_CFG_OFFSET)
#define LPC54_USART6_CTL                (LPC54_FLEXCOMM6_BASE+LPC54_USART_CTL_OFFSET)
#define LPC54_USART6_STAT               (LPC54_FLEXCOMM6_BASE+LPC54_USART_STAT_OFFSET)
#define LPC54_USART6_INTENSET           (LPC54_FLEXCOMM6_BASE+LPC54_USART_INTENSET_OFFSET)
#define LPC54_USART6_INTENCLR           (LPC54_FLEXCOMM6_BASE+LPC54_USART_INTENCLR_OFFSET)
#define LPC54_USART6_BRG                (LPC54_FLEXCOMM6_BASE+LPC54_USART_BRG_OFFSET)
#define LPC54_USART6_INTSTAT            (LPC54_FLEXCOMM6_BASE+LPC54_USART_INTSTAT_OFFSET)
#define LPC54_USART6_OSR                (LPC54_FLEXCOMM6_BASE+LPC54_USART_OSR_OFFSET)
#define LPC54_USART6_FIFOCFG            (LPC54_FLEXCOMM6_BASE+LPC54_USART_FIFOCFG_OFFSET)
#define LPC54_USART6_FIFOSTAT           (LPC54_FLEXCOMM6_BASE+LPC54_USART_FIFOSTAT_OFFSET)
#define LPC54_USART6_FIFOTRIG           (LPC54_FLEXCOMM6_BASE+LPC54_USART_FIFOTRIG_OFFSET)
#define LPC54_USART6_FIFOINTENSET       (LPC54_FLEXCOMM6_BASE+LPC54_USART_FIFOINTENSET_OFFSET)
#define LPC54_USART6_FIFOINTENCLR       (LPC54_FLEXCOMM6_BASE+LPC54_USART_FIFOINTENCLR_OFFSET)
#define LPC54_USART6_FIFOINTSTAT        (LPC54_FLEXCOMM6_BASE+LPC54_USART_FIFOINTSTAT_OFFSET)
#define LPC54_USART6_FIFOWR             (LPC54_FLEXCOMM6_BASE+LPC54_USART_FIFOWR_OFFSET)
#define LPC54_USART6_FIFORD             (LPC54_FLEXCOMM6_BASE+LPC54_USART_FIFORD_OFFSET)
#define LPC54_USART6_FIFORDNOPOP        (LPC54_FLEXCOMM6_BASE+LPC54_USART_FIFORDNOPOP_OFFSET)
#define LPC54_USART6_ID                 (LPC54_FLEXCOMM6_BASE+LPC54_USART_ID_OFFSET)

