apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_usart.h
#define LPC54_USART7_CFG                (LPC54_FLEXCOMM7_BASE+LPC54_USART_CFG_OFFSET)
#define LPC54_USART7_CTL                (LPC54_FLEXCOMM7_BASE+LPC54_USART_CTL_OFFSET)
#define LPC54_USART7_STAT               (LPC54_FLEXCOMM7_BASE+LPC54_USART_STAT_OFFSET)
#define LPC54_USART7_INTENSET           (LPC54_FLEXCOMM7_BASE+LPC54_USART_INTENSET_OFFSET)
#define LPC54_USART7_INTENCLR           (LPC54_FLEXCOMM7_BASE+LPC54_USART_INTENCLR_OFFSET)
#define LPC54_USART7_BRG                (LPC54_FLEXCOMM7_BASE+LPC54_USART_BRG_OFFSET)
#define LPC54_USART7_INTSTAT            (LPC54_FLEXCOMM7_BASE+LPC54_USART_INTSTAT_OFFSET)
#define LPC54_USART7_OSR                (LPC54_FLEXCOMM7_BASE+LPC54_USART_OSR_OFFSET)
#define LPC54_USART7_FIFOCFG            (LPC54_FLEXCOMM7_BASE+LPC54_USART_FIFOCFG_OFFSET)
#define LPC54_USART7_FIFOSTAT           (LPC54_FLEXCOMM7_BASE+LPC54_USART_FIFOSTAT_OFFSET)
#define LPC54_USART7_FIFOTRIG           (LPC54_FLEXCOMM7_BASE+LPC54_USART_FIFOTRIG_OFFSET)
#define LPC54_USART7_FIFOINTENSET       (LPC54_FLEXCOMM7_BASE+LPC54_USART_FIFOINTENSET_OFFSET)
#define LPC54_USART7_FIFOINTENCLR       (LPC54_FLEXCOMM7_BASE+LPC54_USART_FIFOINTENCLR_OFFSET)
#define LPC54_USART7_FIFOINTSTAT        (LPC54_FLEXCOMM7_BASE+LPC54_USART_FIFOINTSTAT_OFFSET)
#define LPC54_USART7_FIFOWR             (LPC54_FLEXCOMM7_BASE+LPC54_USART_FIFOWR_OFFSET)
#define LPC54_USART7_FIFORD             (LPC54_FLEXCOMM7_BASE+LPC54_USART_FIFORD_OFFSET)
#define LPC54_USART7_FIFORDNOPOP        (LPC54_FLEXCOMM7_BASE+LPC54_USART_FIFORDNOPOP_OFFSET)
#define LPC54_USART7_ID                 (LPC54_FLEXCOMM7_BASE+LPC54_USART_ID_OFFSET)

#define LPC54_USART8_CFG                (LPC54_FLEXCOMM8_BASE+LPC54_USART_CFG_OFFSET)
#define LPC54_USART8_CTL                (LPC54_FLEXCOMM8_BASE+LPC54_USART_CTL_OFFSET)
#define LPC54_USART8_STAT               (LPC54_FLEXCOMM8_BASE+LPC54_USART_STAT_OFFSET)
#define LPC54_USART8_INTENSET           (LPC54_FLEXCOMM8_BASE+LPC54_USART_INTENSET_OFFSET)
#define LPC54_USART8_INTENCLR           (LPC54_FLEXCOMM8_BASE+LPC54_USART_INTENCLR_OFFSET)
#define LPC54_USART8_BRG                (LPC54_FLEXCOMM8_BASE+LPC54_USART_BRG_OFFSET)
#define LPC54_USART8_INTSTAT            (LPC54_FLEXCOMM8_BASE+LPC54_USART_INTSTAT_OFFSET)
#define LPC54_USART8_OSR                (LPC54_FLEXCOMM8_BASE+LPC54_USART_OSR_OFFSET)
#define LPC54_USART8_FIFOCFG            (LPC54_FLEXCOMM8_BASE+LPC54_USART_FIFOCFG_OFFSET)
#define LPC54_USART8_FIFOSTAT           (LPC54_FLEXCOMM8_BASE+LPC54_USART_FIFOSTAT_OFFSET)
#define LPC54_USART8_FIFOTRIG           (LPC54_FLEXCOMM8_BASE+LPC54_USART_FIFOTRIG_OFFSET)
#define LPC54_USART8_FIFOINTENSET       (LPC54_FLEXCOMM8_BASE+LPC54_USART_FIFOINTENSET_OFFSET)
#define LPC54_USART8_FIFOINTENCLR       (LPC54_FLEXCOMM8_BASE+LPC54_USART_FIFOINTENCLR_OFFSET)
#define LPC54_USART8_FIFOINTSTAT        (LPC54_FLEXCOMM8_BASE+LPC54_USART_FIFOINTSTAT_OFFSET)
#define LPC54_USART8_FIFOWR             (LPC54_FLEXCOMM8_BASE+LPC54_USART_FIFOWR_OFFSET)
#define LPC54_USART8_FIFORD             (LPC54_FLEXCOMM8_BASE+LPC54_USART_FIFORD_OFFSET)
#define LPC54_USART8_FIFORDNOPOP        (LPC54_FLEXCOMM8_BASE+LPC54_USART_FIFORDNOPOP_OFFSET)
#define LPC54_USART8_ID                 (LPC54_FLEXCOMM8_BASE+LPC54_USART_ID_OFFSET)

#define LPC54_USART9_CFG                (LPC54_FLEXCOMM9_BASE+LPC54_USART_CFG_OFFSET)
#define LPC54_USART9_CTL                (LPC54_FLEXCOMM9_BASE+LPC54_USART_CTL_OFFSET)
#define LPC54_USART9_STAT               (LPC54_FLEXCOMM9_BASE+LPC54_USART_STAT_OFFSET)
#define LPC54_USART9_INTENSET           (LPC54_FLEXCOMM9_BASE+LPC54_USART_INTENSET_OFFSET)
#define LPC54_USART9_INTENCLR           (LPC54_FLEXCOMM9_BASE+LPC54_USART_INTENCLR_OFFSET)
#define LPC54_USART9_BRG                (LPC54_FLEXCOMM9_BASE+LPC54_USART_BRG_OFFSET)
#define LPC54_USART9_INTSTAT            (LPC54_FLEXCOMM9_BASE+LPC54_USART_INTSTAT_OFFSET)
#define LPC54_USART9_OSR                (LPC54_FLEXCOMM9_BASE+LPC54_USART_OSR_OFFSET)
#define LPC54_USART9_FIFOCFG            (LPC54_FLEXCOMM9_BASE+LPC54_USART_FIFOCFG_OFFSET)
#define LPC54_USART9_FIFOSTAT           (LPC54_FLEXCOMM9_BASE+LPC54_USART_FIFOSTAT_OFFSET)
#define LPC54_USART9_FIFOTRIG           (LPC54_FLEXCOMM9_BASE+LPC54_USART_FIFOTRIG_OFFSET)
#define LPC54_USART9_FIFOINTENSET       (LPC54_FLEXCOMM9_BASE+LPC54_USART_FIFOINTENSET_OFFSET)
#define LPC54_USART9_FIFOINTENCLR       (LPC54_FLEXCOMM9_BASE+LPC54_USART_FIFOINTENCLR_OFFSET)
#define LPC54_USART9_FIFOINTSTAT        (LPC54_FLEXCOMM9_BASE+LPC54_USART_FIFOINTSTAT_OFFSET)
#define LPC54_USART9_FIFOWR             (LPC54_FLEXCOMM9_BASE+LPC54_USART_FIFOWR_OFFSET)
#define LPC54_USART9_FIFORD             (LPC54_FLEXCOMM9_BASE+LPC54_USART_FIFORD_OFFSET)
#define LPC54_USART9_FIFORDNOPOP        (LPC54_FLEXCOMM9_BASE+LPC54_USART_FIFORDNOPOP_OFFSET)
#define LPC54_USART9_ID                 (LPC54_FLEXCOMM9_BASE+LPC54_USART_ID_OFFSET)

/* USART Register Bitfield Definitions ***************************************************************/

/* USART Configuration register */

#define USART_CFG_ENABLE                (1 << 0)  /* Bit 0  USART Enable */
#define USART_CFG_DATALEN_SHIFT         (2)       /* Bits 2-3: Selects the data size for the USART */
#define USART_CFG_DATALEN_MASK          (3 << USART_CFG_DATALEN_SHIFT)
#  define USART_CFG_DATALEN_7BIT        (0 << USART_CFG_DATALEN_SHIFT) /* 7 bit Data length */
#  define USART_CFG_DATALEN_8BIT        (1 << USART_CFG_DATALEN_SHIFT) /* 8 bit Data length */
#  define USART_CFG_DATALEN_9BIT        (2 << USART_CFG_DATALEN_SHIFT) /* 9 bit data lengt */
#define USART_CFG_PARITYSEL_SHIFT       (4)       /* Bits 4-5: Selects what type of parity is used by the USART */
#define USART_CFG_PARITYSEL_MASK        (3 << USART_CFG_PARITYSEL_SHIFT)
#  define USART_CFG_PARITYSEL_NONE      (0 << USART_CFG_PARITYSEL_SHIFT) /* No parity */
#  define USART_CFG_PARITYSEL_EVEN      (2 << USART_CFG_PARITYSEL_SHIFT) /* Even parity */
#  define USART_CFG_PARITYSEL_ODD       (3 << USART_CFG_PARITYSEL_SHIFT) /* Odd parity */
#define USART_CFG_STOPLEN               (1 << 6)  /* Bit 6  Number of stop bits appended to transmitted data */
#define USART_CFG_MODE32K               (1 << 7)  /* Bit 7  Selects standard or 32 kHz clocking mode */
#define USART_CFG_LINMODE               (1 << 8)  /* Bit 8  LIN break mode enable */
#define USART_CFG_CTSEN                 (1 << 9)  /* Bit 9  CTS Enable */
#define USART_CFG_SYNCEN                (1 << 11) /* Bit 11 Selects synchronous or asynchronous operation */
#define USART_CFG_CLKPOL                (1 << 12) /* Bit 12 Selects clock polarity and sampling edge of RX data */
#define USART_CFG_SYNCMST               (1 << 14) /* Bit 14 Synchronous mode Master select */
#define USART_CFG_LOOP                  (1 << 15) /* Bit 15 Selects data loopback mode */
#define USART_CFG_OETA                  (1 << 18) /* Bit 18 Output Enable Turnaround time enable for RS-485 operation */
#define USART_CFG_AUTOADDR              (1 << 19) /* Bit 19 Automatic Address matching enable */
#define USART_CFG_OESEL                 (1 << 20) /* Bit 20 Output Enable Select */
#define USART_CFG_OEPOL                 (1 << 21) /* Bit 21 Output Enable Polarity */
#define USART_CFG_RXPOL                 (1 << 22) /* Bit 22 Receive data polarity */
#define USART_CFG_TXPOL                 (1 << 23) /* Bit 23 Transmit data polarity */

/* USART Control register */

#define USART_CTL_TXBRKEN               (1 << 1)  /* Bit 1:  Break Enable */
#define USART_CTL_ADDRDET               (1 << 2)  /* Bit 2:  Enable address detect mode */
#define USART_CTL_TXDIS                 (1 << 6)  /* Bit 6:  Transmit Disable */
#define USART_CTL_CC                    (1 << 8)  /* Bit 8:  Continuous Clock generation */
#define USART_CTL_CLRCCONRX             (1 << 9)  /* Bit 9:  Clear Continuous Clock */
#define USART_CTL_AUTOBAUD              (1 << 16) /* Bit 16: Autobaud enable */

